# Проброс портов Cisco (Настройка Port Forwarding)

Очень частый вопрос у обладателей маршрутизаторов Циско начального и среднего уровня, например, `Cisco 811, 819, 877, 881` — это как настроить проброс портов, то есть так называемый `port forwarding`. Эта функция может использоваться для того, чтобы открыть доступ из вне к web-серверу или регистратору, который находится за роутером.

Сделать это не сложно. Чтобы сконфигурировать p`ort forwarding` на `Cisco` будем использовать `Static NAT`.

Синтаксис команды выглядит следующим образом:

> ip nat inside source static <внутренний ip-адрес> <внешний ip-адрес> extendable

 В качестве примера настроим проброс порт `TCP 8081` для http-сервера с внешнего `IP: 88.147.164.1` на внутренний узел: `192.168.1.2`.  Телнетимся и авторизуемся на роутере.

Затем, входим в режим «`Enable`»:

```bash
Router> enable 
```

Затем переходим в режим конфигурации:

```bash
Router# configure terminal
```

Статический проброс портов

```bash
Router(config)#ip nat inside source static tcp 10.0.0.2 80 11.22.34.2 80
Router(config)#ip nat inside source static tcp 10.0.0.3 443 11.22.34.2 443
```

Прописываем проброс порта на `Cisco`:

```bash
Router(config)# ip nat inside source static tcp 192.168.1.2 88.147.164.1 8081 extendable
```

Готово. Набираем команду `end` или `exit` для выхода из режима конфигурации и сохраняем конфиг.

Думаю понятно, что если надо будет открыть `UDP`-порт, то нужно указать этот протокол в команде вместо `TCP`. `Static NAT` позволяет полностью открыть порты для определённого узла в сети.

Для этого используем команду:

```bash
ip nat inside source static 192.168.1.2 88.147.164.1 extendable
```

`Port Forwarding` будет осуществляться для всех портов внутреннего узла без привязки к протоколу.
